Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S4A.atdf
        <register caption="Channel Data Register 5" name="ADC_CDR5" offset="0x64" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 6" name="ADC_CDR6" offset="0x68" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 7" name="ADC_CDR7" offset="0x6C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 8" name="ADC_CDR8" offset="0x70" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 9" name="ADC_CDR9" offset="0x74" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 10" name="ADC_CDR10" offset="0x78" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 11" name="ADC_CDR11" offset="0x7C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 12" name="ADC_CDR12" offset="0x80" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 13" name="ADC_CDR13" offset="0x84" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 14" name="ADC_CDR14" offset="0x88" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 15" name="ADC_CDR15" offset="0x8C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Analog Control Register" name="ADC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Temperature Sensor On" mask="0x00000010" name="TSON"/>
          <bitfield caption="ADC Bias Current Control" mask="0x00000300" name="IBCTL"/>
        </register>
        <register caption="Write Protection Mode Register" name="ADC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="ADC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ADC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="ADC_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="ADC_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="ADC_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="ADC_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="ADC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="ADC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="ADC_MR__TRGEN">
        <value caption="Hardware triggers are disabled. Starting a conversion is only possible by software." name="DIS" value="0"/>
        <value caption="Hardware trigger selected by TRGSEL field is enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__TRGSEL">
        <value caption="External trigger" name="ADC_TRIG0" value="0x0"/>
        <value caption="TIO Output of the Timer Counter Channel 0" name="ADC_TRIG1" value="0x1"/>
        <value caption="TIO Output of the Timer Counter Channel 1" name="ADC_TRIG2" value="0x2"/>
        <value caption="TIO Output of the Timer Counter Channel 2" name="ADC_TRIG3" value="0x3"/>
        <value caption="PWM Event Line 0" name="ADC_TRIG4" value="0x4"/>
        <value caption="PWM Event Line 1" name="ADC_TRIG5" value="0x5"/>
      </value-group>
      <value-group caption="" name="ADC_MR__SLEEP">
        <value caption="Normal Mode: The ADC core and reference voltage circuitry are kept ON between conversions." name="NORMAL" value="0"/>
        <value caption="Sleep Mode: The wake-up time can be modified by programming FWUP bit." name="SLEEP" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__FWUP">
        <value caption="If SLEEP is 1, then both ADC core and reference voltage circuitry are OFF between conversions" name="OFF" value="0"/>
        <value caption="If SLEEP is 1, then Fast Wake-up Sleep mode: The voltage reference is ON between conversions and ADC core is OFF" name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__FREERUN">
        <value caption="Normal Mode" name="OFF" value="0"/>
        <value caption="Free Run Mode: Never wait for any trigger." name="ON" value="1"/>
      </value-group>
